NivyaS2k15/embeddedSystemMain/Embedded_Software_Project_STM32/SPI_PRO/spi_project/Src/main.c

/**
 ******************************************************************************
 * @file           : main.c
 * @author         : NIVYA
 * @brief          : SPI Full-Duplex Communication with USART2 Logging
 ******************************************************************************
 *
 * Description:
 * This program demonstrates SPI full-duplex communication between an
 * STM32F446RE Nucleo board (Master) and an Arduino Uno (Slave). The
 * STM32 initializes GPIO, SPI1, and USART2 peripherals, transmits the
 * string "hai" to the Arduino, and simultaneously receives a response
 * from the slave device using the SPI full-duplex protocol.
 *
 * The received data is stored in a buffer and forwarded to a PC through
 * USART2 at 115200 baud, allowing the communication to be monitored on
 * a serial terminal such as PuTTY. Software Slave Select (SS) is
 * implemented using GPIO PA4, where the pin is pulled LOW before the
 * SPI transfer and HIGH after completion.
 *
 * Peripherals Used:
 * - GPIOA : SPI1 (PA5-SCK, PA6-MISO, PA7-MOSI, PA4-SS)
 * - SPI1  : Full-Duplex Master Communication
 * - USART2: Serial Logging (PA2-TX, PA3-RX)
 *
 * Functionality:
 * 1. Initialize GPIO, SPI1, and USART2.
 * 2. Configure PA4 as Software Slave Select (SS).
 * 3. Send the string "hai" to the Arduino via SPI.
 * 4. Receive the Arduino response simultaneously.
 * 5. Display the received message on the serial terminal.
 * 6. Repeat the communication every 2 seconds.
 *
 ******************************************************************************
 */


#include <stdio.h>
#include <string.h>
#include "stm32f446xx.h"
#include "stm32f446xx_gpio_driver.h"
#include "stm32f446xx_spi_driver.h"
#include "stm32f446xx_usart_driver.h"

// Global Handle for USART2
USART_Handle_t usart2_handle;

void delay_ms(uint32_t ms)
{
    for(uint32_t i = 0; i < (ms * 1000); i++);
}

/* * Configure USART2 Pins: PA2 (TX) and PA3 (RX)
 */
void USART2_GPIOInit(void)
{
    GPIO_Handle_t usart_gpios = {0};
    usart_gpios.pGPIOx = GPIOA;
    usart_gpios.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
    usart_gpios.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    usart_gpios.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
    usart_gpios.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
    usart_gpios.GPIO_PinConfig.GPIO_PinAltFunMode = 7; // AF7 is USART2

    // Configure PA2 (TX)
    usart_gpios.GPIO_PinConfig.GPIO_PinNumber = 2;
    GPIO_Init(&usart_gpios);

    // Configure PA3 (RX)
    usart_gpios.GPIO_PinConfig.GPIO_PinNumber = 3;
    GPIO_Init(&usart_gpios);
}

/* * Configure USART2 Hardware Parameters
 */
void USART2_Init(void)
{
    usart2_handle.pUSARTx = USART2;
    usart2_handle.USART_Config.USART_Baud = USART_STD_BAUD_115200;
    usart2_handle.USART_Config.USART_HWFlowControl = USART_HW_FLOW_CTRL_NONE;
    usart2_handle.USART_Config.USART_Mode = USART_MODE_TXRX;
    usart2_handle.USART_Config.USART_ParityControl = USART_PARITY_DISABLE;
    usart2_handle.USART_Config.USART_NoOfStopBits = USART_STOPBITS_1;
    usart2_handle.USART_Config.USART_WordLength = USART_WORDLEN_8BITS;

    USART_Init(&usart2_handle);
}

/* * Configure SPI1 Pins: PA5 (SCK), PA6 (MISO), PA7 (MOSI)
 */
void SPI1_GPIOInit(void)
{
    GPIO_Handle_t spi_gpios = {0};
    spi_gpios.pGPIOx = GPIOA;
    spi_gpios.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
    spi_gpios.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    spi_gpios.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    spi_gpios.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
    spi_gpios.GPIO_PinConfig.GPIO_PinAltFunMode = 5; // AF5 is SPI1

    // PA5 -> SCK
    spi_gpios.GPIO_PinConfig.GPIO_PinNumber = 5;
    GPIO_Init(&spi_gpios);

    // PA6 -> MISO
    spi_gpios.GPIO_PinConfig.GPIO_PinNumber = 6;
    GPIO_Init(&spi_gpios);

    // PA7 -> MOSI
    spi_gpios.GPIO_PinConfig.GPIO_PinNumber = 7;
    GPIO_Init(&spi_gpios);
}

/* * Configure SPI1 Hardware Engine
 */
void SPI1_Init(void)
{
    SPI_Handle_t spi1_handle = {0};
    spi1_handle.pSPIx = SPI1;
    spi1_handle.SPI_Config.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
    spi1_handle.SPI_Config.SPI_BusConfig  = SPI_BUS_CONFIG_FULL_DUPLEX;
    spi1_handle.SPI_Config.SPI_DFF        = SPI_DFF_8BITS;
    spi1_handle.SPI_Config.SPI_CPOL       = SPI_CPOL_LOW;  // Mode 0
    spi1_handle.SPI_Config.SPI_CPHA       = SPI_CPHA_LOW;  // Mode 0
    spi1_handle.SPI_Config.SPI_SSM        = SPI_SSM_EN;    // Software Slave Management enabled
    spi1_handle.SPI_Config.SPI_SclkSpeed  = SPI_SCLK_SPEED_DIV32;

    SPI_Init(&spi1_handle);
}

/* * Setup PA4 as standard GPIO Output for Software Slave Select (NSS)
 */
void SPI1_SS_GPIOInit(void)
{
    GPIO_Handle_t ss_pin = {0};
    ss_pin.pGPIOx = GPIOA;
    ss_pin.GPIO_PinConfig.GPIO_PinNumber = 4;
    ss_pin.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    ss_pin.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    ss_pin.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    ss_pin.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
    GPIO_Init(&ss_pin);

    // Default state to HIGH (Deselected)
    GPIO_WriteToOutputPin(GPIOA, 4, GPIO_PIN_SET);
}

int main(void)
{
    char *message = "hai";
    uint32_t message_len = strlen(message);
    uint8_t rx_buffer[4] = {0};
    char uart_log[64];

    // 1. Enable Core Peripheral Bus Clocks
    GPIO_PeriClockControl(GPIOA, ENABLE);
    USART_PeriClockControl(USART2, ENABLE);
    SPI_PeriClockControl(SPI1, ENABLE);

    // 2. Hardware Peripheral Hookups
    USART2_GPIOInit();
    USART2_Init();
    USART_PeripheralControl(USART2, ENABLE);

    SPI1_GPIOInit();
    SPI1_SS_GPIOInit();
    SPI1_Init();
    SPI_PeripheralControl(SPI1, ENABLE);

    while(1)
    {
        // Assert Slave (Pull SS Low)
        GPIO_WriteToOutputPin(GPIOA, 4, GPIO_PIN_RESET);

        // Send & Receive simultaneously byte-by-byte
        for(uint32_t i = 0; i < message_len; i++)
        {
            rx_buffer[i] = SPI_SendReceiveByte(SPI1, (uint8_t)message[i]);
        }
        rx_buffer[message_len] = '\0'; // Null-terminate string array

        // Short transfer settling delay
        for(volatile uint32_t i = 0; i < 500; i++);

        // De-assert Slave (Pull SS High)
        GPIO_WriteToOutputPin(GPIOA, 4, GPIO_PIN_SET);

        // Forward the captured response payload onto your PuTTY terminal
        sprintf(uart_log, "[SPI RX]: Message from Arduino -> %s\r\n", rx_buffer);
        USART_SendData(&usart2_handle, (uint8_t*)uart_log, strlen(uart_log));

        // Wait 2 seconds before running next block sequence
        delay_ms(2000);
    }

    return 0;
}
